my_api/app/controllers/users_controller.rb

  def my_create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "323323223"], ["status", 9999], ["created_at", "2019-09-27 07:11:34.800755"], ["updated_at", "2019-09-27 07:11:34.800755"]]

  def my_delete
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

  def my_update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "qqqqzzzz"], ["status", 8999], ["updated_at", "2019-09-27 07:23:51.099821"], ["id", 7]]

  def my_retrieveall
    @users = User.all
---
SELECT "users".* FROM "users"

  def my_retrieve
    if @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]