myapi2/app/controllers/books_controller.rb

  def my_create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "thinking in java"], ["created_at", "2019-09-29 02:14:27.629276"], ["updated_at", "2019-09-29 02:14:27.629276"]]

  def my_delete
    @book = Book.find(params[:id])
    if @book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]

  def my_update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "books" SET "name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "thinking in java(第4版本)"], ["updated_at", "2019-09-29 02:31:46.896107"], ["id", 7]]

  def my_retrieveall
    @books = Book.all
---
SELECT "books".* FROM "books"

  def my_retrieve
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def my_down_file_CarrierWave_with_Books
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def my_up_file_CarrierWave_with_Books
    b = Book.new
    b.avatar = params[:localfile]
    b.save
---
INSERT INTO "books" ("created_at", "updated_at", "avatar") VALUES (?, ?, ?)  [["created_at", "2019-09-29 07:19:30.445756"], ["updated_at", "2019-09-29 07:19:30.445756"], ["avatar", "大数据知识图谱.jpg"]]